*** Creating the us_counties_2010 Table


The code in [[file:ch04.xhtml#ch04list2][Listing 4-2]] shows only an abbreviated version of the CREATE TABLE script; many of the columns have been omitted. The full version is available (and annotated) along with all the code examples in the book's resources. To import it properly, you'll need to download the full table definition.

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis

CREATE TABLE us_counties_2010 (
    geo_name varchar(90),                    -- Name of the geography
    state_us_abbreviation varchar(2),        -- State/U.S. abbreviation
    summary_level varchar(3),                -- Summary Level
    region smallint,                         -- Region
    division smallint,                       -- Division
    state_fips varchar(2),                   -- State FIPS code
    county_fips varchar(3),                  -- County code
    area_land bigint,                        -- Area (Land) in square meters
    area_water bigint,                        -- Area (Water) in square meters
    population_count_100_percent integer,    -- Population count (100%)
    housing_unit_count_100_percent integer,  -- Housing Unit count (100%)
    internal_point_lat numeric(10,7),        -- Internal point (latitude)
    internal_point_lon numeric(10,7),        -- Internal point (longitude)

    -- This section is referred to as P1. Race:
    p0010001 integer,   -- Total population
    p0010002 integer,   -- Population of one race:
    p0010003 integer,       -- White Alone
    p0010004 integer,       -- Black or African American alone
    p0010005 integer,       -- American Indian and Alaska Native alone
    p0010006 integer,       -- Asian alone
    p0010007 integer,       -- Native Hawaiian and Other Pacific Islander alone
    p0010008 integer,       -- Some Other Race alone
    p0010009 integer,   -- Population of two or more races
    p0010010 integer,   -- Population of two races:
    p0010011 integer,       -- White; Black or African American
    p0010012 integer,       -- White; American Indian and Alaska Native
    p0010013 integer,       -- White; Asian
    p0010014 integer,       -- White; Native Hawaiian and Other Pacific Islander
    p0010015 integer,       -- White; Some Other Race
    p0010016 integer,       -- Black or African American; American Indian and Alaska Native
    p0010017 integer,       -- Black or African American; Asian
    p0010018 integer,       -- Black or African American; Native Hawaiian and Other Pacific Islander
    p0010019 integer,       -- Black or African American; Some Other Race
    p0010020 integer,       -- American Indian and Alaska Native; Asian
    p0010021 integer,       -- American Indian and Alaska Native; Native Hawaiian and Other Pacific Islander
    p0010022 integer,       -- American Indian and Alaska Native; Some Other Race
    p0010023 integer,       -- Asian; Native Hawaiian and Other Pacific Islander
    p0010024 integer,       -- Asian; Some Other Race
    p0010025 integer,       -- Native Hawaiian and Other Pacific Islander; Some Other Race
    p0010026 integer,   -- Population of three races
    p0010047 integer,   -- Population of four races
    p0010063 integer,   -- Population of five races
    p0010070 integer,   -- Population of six races

    -- This section is referred to as P2. HISPANIC OR LATINO, AND NOT HISPANIC OR LATINO BY RACE
    p0020001 integer,   -- Total
    p0020002 integer,   -- Hispanic or Latino
    p0020003 integer,   -- Not Hispanic or Latino:
    p0020004 integer,   -- Population of one race:
    p0020005 integer,       -- White Alone
    p0020006 integer,       -- Black or African American alone
    p0020007 integer,       -- American Indian and Alaska Native alone
    p0020008 integer,       -- Asian alone
    p0020009 integer,       -- Native Hawaiian and Other Pacific Islander alone
    p0020010 integer,       -- Some Other Race alone
    p0020011 integer,   -- Two or More Races
    p0020012 integer,   -- Population of two races
    p0020028 integer,   -- Population of three races
    p0020049 integer,   -- Population of four races
    p0020065 integer,   -- Population of five races
    p0020072 integer,   -- Population of six races

    -- This section is referred to as P3. RACE FOR THE POPULATION 18 YEARS AND OVER
    p0030001 integer,   -- Total
    p0030002 integer,   -- Population of one race:
    p0030003 integer,       -- White alone
    p0030004 integer,       -- Black or African American alone
    p0030005 integer,       -- American Indian and Alaska Native alone
    p0030006 integer,       -- Asian alone
    p0030007 integer,       -- Native Hawaiian and Other Pacific Islander alone
    p0030008 integer,       -- Some Other Race alone
    p0030009 integer,   -- Two or More Races
    p0030010 integer,   -- Population of two races
    p0030026 integer,   -- Population of three races
    p0030047 integer,   -- Population of four races
    p0030063 integer,   -- Population of five races
    p0030070 integer,   -- Population of six races

    -- This section is referred to as P4. HISPANIC OR LATINO, AND NOT HISPANIC OR LATINO BY RACE
    -- FOR THE POPULATION 18 YEARS AND OVER
    p0040001 integer,   -- Total
    p0040002 integer,   -- Hispanic or Latino
    p0040003 integer,   -- Not Hispanic or Latino:
    p0040004 integer,   -- Population of one race:
    p0040005 integer,   -- White alone
    p0040006 integer,   -- Black or African American alone
    p0040007 integer,   -- American Indian and Alaska Native alone
    p0040008 integer,   -- Asian alone
    p0040009 integer,   -- Native Hawaiian and Other Pacific Islander alone
    p0040010 integer,   -- Some Other Race alone
    p0040011 integer,   -- Two or More Races
    p0040012 integer,   -- Population of two races
    p0040028 integer,   -- Population of three races
    p0040049 integer,   -- Population of four races
    p0040065 integer,   -- Population of five races
    p0040072 integer,   -- Population of six races

    -- This section is referred to as H1. OCCUPANCY STATUS
    h0010001 integer,   -- Total housing units
    h0010002 integer,   -- Occupied
    h0010003 integer    -- Vacant
);
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|

/Listing 4-2: A CREATE TABLE statement for census county data/

To create the table, in pgAdmin click the analysis database that you created in [[file:ch01.xhtml#ch01][Chapter 1]]. (It's best to store the data in this book in analysis because we'll reuse some of it in later chapters.) From the pgAdmin menu bar, select *Tools ▸ Query Tool*. Paste the script into the window and run it.

Return to the main pgAdmin window, and in the object browser, right-click and refresh the analysis database. Choose *Schemas ▸ public ▸ Tables* to see the new table. Although it's empty, you can see the structure by running a basic SELECT query in pgAdmin's Query Tool:

SELECT * from us_counties_2010;

When you run the SELECT query, you'll see the columns in the table you created. No data rows exist yet.

*** Performing the Census Import with COPY

Now you're ready to bring the census data into the table. Run the code in [[file:ch04.xhtml#ch04list3][Listing 4-3]], remembering to change the path to the file to match the location of the data on your computer:

#+begin_src sql :engine postgresql :dbuser postgres  :dbpassword 1618 :database analysis
\copy us_counties_2010 FROM 'data/us_counties_2010.csv' WITH (FORMAT CSV, HEADER);
#+end_src

#+RESULTS:
| COPY 3143 |
|-----------|

/Listing 4-3: Importing census data using COPY/

#+BEGIN_SRC shell
ls -l 'data/us_counties_2010.csv' | sed "s/$USER/me/g"
#+END_SRC

#+RESULTS:
: -rw-rw-r-- 1 me me 1170359 Dec  7 10:22 data/us_counties_2010.csv

When the code executes, you should see the following message in pgAdmin:

Query returned successfully: 3143 rows affected

That's good news: the import CSV has the same number of rows. If you have an issue with the source CSV or your import statement, the database will throw an error. For example, if one of the rows in the CSV had more columns than in the target table, you'd see an error message that provides a hint as to how to fix it:

ERROR: extra data after last expected column
SQL state: 22P04
Context: COPY us_counties_2010, line 2: "Autauga County,AL,050,3,6,01,001 ..."

Even if no errors are reported, it's always a good idea to visually scan the data you just imported to ensure everything looks as expected. Start with a SELECT query of all columns and rows:

SELECT * FROM us_counties_2010;

There should be 3,143 rows displayed in pgAdmin, and as you scroll left and right through the result set, each field should have the expected values. Let's review some columns that we took particular care to define with the appropriate data types. For example, run the following query to show the counties with the largest area_land values. We'll use a LIMIT clause, which will cause the query to only return the number of rows we want; here, we'll ask for three:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
SELECT geo_name, state_us_abbreviation, area_land
FROM us_counties_2010
ORDER BY area_land DESC
LIMIT 3;
#+end_src

#+RESULTS:
| geo_name                  | state_us_abbreviation |    area_land |
|---------------------------+-----------------------+--------------|
| Yukon-Koyukuk Census Area | AK                    | 376855656455 |
| North Slope Borough       | AK                    | 229720054439 |
| Bethel Census Area        | AK                    | 105075822708 |

This query ranks county-level geographies from largest land area to smallest in square meters. We defined area_land as bigint because the largest values in the field are bigger than the upper range provided by regular integer. As you might expect, big Alaskan geographies are at the top:


Next, check the latitude and longitude columns of internal_point_lat and internal_point_lon, which we defined with numeric(10,7). This code sorts the counties by longitude from the greatest to smallest value. This time, we'll use LIMIT to retrieve five rows:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
SELECT geo_name, state_us_abbreviation, internal_point_lon
FROM us_counties_2010
ORDER BY internal_point_lon DESC
LIMIT 5;
#+end_src

#+RESULTS:
| geo_name                   | state_us_abbreviation | internal_point_lon |
|----------------------------+-----------------------+--------------------|
| Aleutians West Census Area | AK                    |        178.3388130 |
| Washington County          | ME                    |        -67.6093542 |
| Hancock County             | ME                    |        -68.3707034 |
| Aroostook County           | ME                    |        -68.6494098 |
| Penobscot County           | ME                    |        -68.6574869 |

Longitude measures locations from east to west, with locations west of the Prime Meridian in England represented as negative numbers starting with −1, −2, −3, and so on the farther west you go. We sorted in descending order, so we'd expect the easternmost counties of the United States to show at the top of the query result. Instead---surprise!---there's a lone Alaska geography at the top:

Here's why: the Alaskan Aleutian Islands extend so far west (farther west than Hawaii) that they cross the antimeridian at 180 degrees longitude by less than 2 degrees. Once past the antimeridian, longitude turns positive, counting back down to 0. Fortunately, it's not a mistake in the data; however, it's a fact you can tuck away for your next trivia team competition.

Congratulations! You have a legitimate set of government demographic data in your database. I'll use it to demonstrate exporting data with COPY later in this chapter, and then you'll use it to learn math functions in [[file:ch05.xhtml#ch05][Chapter 5]]. Before we move on to exporting data, let's examine a few additional importing techniques.

** Importing a Subset of Columns with COPY


If a CSV file doesn't have data for all the columns in your target database table, you can still import the data you have by specifying which columns are present in the data. Consider this scenario: you're researching the salaries of all town supervisors in your state so you can analyze government spending trends by geography. To get started, you create a table called supervisor_salaries with the code in [[file:ch04.xhtml#ch04list4][Listing 4-4]]:
#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
drop table  supervisor_salaries;
#+end_src

#+RESULTS:
| DROP TABLE |
|------------|

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis :results none
CREATE TABLE supervisor_salaries (
town varchar(30),
county varchar(30),
supervisor varchar(30),
start_date date,
salary money,
benefits money
);
#+end_src
/Listing 4-4: Creating a table to track supervisor salaries/


#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
select * from supervisor_salaries;
#+end_src

#+RESULTS:
| town | county | supervisor | start_date | salary | benefits |
|------+--------+------------+------------+--------+----------|

You want columns for the town and county, the supervisor's name, the date he or she started, and salary and benefits (assuming you just care about current levels). However, the first county clerk you contact says, “Sorry, we only have town, supervisor, and salary. You'll need to get the rest from elsewhere.” You tell them to send a CSV anyway. You'll import what you can.

I've included such a sample CSV you can download in the book's resources at /[[https://www.nostarch.com/practicalSQL/]]/, called /supervisor_salaries.csv/. You could try to import it using this basic COPY syntax:


#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis :results none
\copy supervisor_salaries FROM 'data/supervisor_salaries.csv'  WITH (FORMAT CSV, HEADER);
#+end_src

#+RESULTS:
|   |


But if you do, PostgreSQL will return an error:

psql:/tmp/babel-PSl3Td/sql-in-ZJqvjf:1: ERROR:  column "town" of relation "supervisor_salaries" does not exist

The database complains that when it got to the fourth column of the table, start_date, it couldn't find any data in the CSV. The workaround for this situation is to tell the database which columns in the table are present in the CSV, as shown in [[file:ch04.xhtml#ch04list5][Listing 4-5]]:

#+begin_src sql :engine postgresql :dbuser postgres :dbpassword 1618 :database analysis
\copy supervisor_salaries (town, supervisor, salary) FROM 'data/supervisor_salaries.csv' WITH (FORMAT CSV, HEADER);
#+end_src

#+RESULTS:
| COPY 5 |
|--------|
/Listing 4-5: Importing salaries data from CSV to three table columns/

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
drop table  supervisor_salaries;
#+end_src

#+RESULTS:
| DROP TABLE |
|------------|

By noting in parentheses the three present columns after the table name, we tell PostgreSQL to only look for data to fill those columns when it reads the CSV. Now, if you select the first couple of rows from the table, you'll see only those columns filled:
#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
select * from supervisor_salaries;
#+end_src

#+RESULTS:
| town        | county | supervisor | start_date | salary      | benefits |
|-------------+--------+------------+------------+-------------+----------|
| Anytown     |        | Jones      |            | ￥27,000.00 |          |
| Bumblyburg  |        | Baker      |            | ￥24,999.00 |          |
| Moetown     |        | Smith      |            | ￥32,100.00 |          |
| Bigville    |        | Kao        |            | ￥31,500.00 |          |
| New Brillig |        | Carroll    |            | ￥72,690.00 |          |

